#+STARTUP: content showstars indent
#+FILETAGS: dnd charsheet Chewy Eshieldoor
#+TITLE: Dr Henry Jones - Character Sheet

* Constants
  #+NAME: define-constants-with-src-block
  #+BEGIN_SRC elisp :var table=stats :colnames yes :results output drawer :cache yes :lang elisp
    (dnd-output-ability-constants table)
  #+END_SRC

  #+RESULTS[bd771d1589f45bf991e5d0f921b30d5938fd5bd3]: define-constants-with-src-block
  :results:
  #+CONSTANTS: STR=13
  #+CONSTANTS: DEX=12
  #+CONSTANTS: CON=10
  #+CONSTANTS: INT=16
  #+CONSTANTS: WIS=8
  #+CONSTANTS: CHA=15
  #+CONSTANTS: PROF=2
  #+CONSTANTS: SCA=
  #+CONSTANTS: SAM=
  :end:
  
* Traits
  | Level | Race  | Subrace | Class     | Subclass     | Age | Alignment    | Size             |
  |-------+-------+---------+-----------+--------------+-----+--------------+------------------|
  |    3  | Human | Variant | Artificer | Battle Smith |  37 | Chaotic Good | Medium(175) 6'1" |

* Stats  
  | Speed | Hit Points    | AC    | Throws        | Inspiration | Hit Die | Exhaustion |
  |-------+---------------+-------+---------------+-------------+---------+------------|
  |    30 | 3/18 (1d8(5)) | 14 +1 | Save:  Death: | x           |       1 |            |

* Abilities and Skills
  #+name:| Ability | Score | Mod | PB | Roll           | Skill                 |
  |---------+-------+-----+----+----------------+-----------------------|
  | STR     |    13 |   1 |    | 1d20 + 1       | Saving Throw          |
  |         |       |     |    | 1d20 + 1       | Athletics             |
  |---------+-------+-----+----+----------------+-----------------------|
  | DEX     |    12 |   1 |    | 1d20 + 1       | Saving Throw          |
  |         |       |     |    | 1d20 + 1       | Acrobatics            |
  |         |       |     | X  | 1d20 + 3       | Sleight of Hand       |
  |         |       |     |    | 1d20 + 1       | Stealth               |
  |---------+-------+-----+----+----------------+-----------------------|
  | CON     |    10 |   0 | X  | 1d20 + 2       | Saving Throw          |
  |---------+-------+-----+----+----------------+-----------------------|
  | INT     |    16 |   3 | X  | 1d20 + 5       | Saving Throw          |
  |         |       |     | X  | 1d20 + 5       | Arcana                |
  |         |       |     | XX | 1d20 + 7       | History               |
  |         |       |     |    | 1d20 + 3       | Investigation         |
  |         |       |     |    | 1d20 + 3       | Nature                |
  |         |       |     | X  | 1d20 + 5       | Religion              |
  |---------+-------+-----+----+----------------+-----------------------|
  | WIS     |     8 |  -1 |    | 1d20 + -1      | Saving Throw          |
  |         |       |     |    | 1d20 + -1      | Animal Handling       |
  |         |       |     |    | 1d20 + -1      | Insight               |
  |         |       |     |    | 1d20 + -1      | Medicine              |
  |         |       |     | X  | 1d20 + 1       | Perception            |
  |         |       |     | X  | 1d20 + 1       | Survival              |
  |---------+-------+-----+----+----------------+-----------------------|
  | CHA     |    15 |   2 |    | 1d20 + 2       | Saving Throw          |
  |         |       |     |    | 1d20 + 2       | Deception             |
  |         |       |     |    | 1d20 + 2       | Intimidation          |
  |         |       |     |    | 1d20 + 2       | Performance           |
  |         |       |     |    | 1d20 + 2       | Persuasion            |
  |---------+-------+-----+----+----------------+-----------------------|
  | PROF    |     2 |     |    |                |                       |
  | SCA     |    13 |     |    | 8 + PROF + INT | SPELL CASTING ABILITY |
  | SAM     |     5 |     |    | PROF + INT     | SPELL ATT MOD         |
  #+TBLFM: @2$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @4$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @8$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @9$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @15$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @21$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @2$5..@3$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @2$1))))))
  #+TBLFM: @4$5..@7$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @4$1))))))
  #+TBLFM: @8$5..@8$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @8$1))))))
  #+TBLFM: @9$5..@14$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @9$1))))))
  #+TBLFM: @15$5..@20$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @15$1))))))
  #+TBLFM: @21$5..@25$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @21$1))))))
  
* Attacks
  #+NAME: attacks
  | Weapon             | Ability | Prof | Type     | Die | Mod To Hit | Roll    |
  |--------------------+---------+------+----------+-----+------------+---------|
  | Whip +1            | INT     | X    | Slashing | 1d4 |          5 | 1d4 + 3 |
  | Light Cross Bow +1 | INT     | X    | Piercing | 1d8 |          5 | 1d8 + 3 |
  #+TBLFM: $6='(+ (if (string= $3 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant $2))))
  #+TBLFM: $7='(concat $5 " + " (number-to-string (calc-dnd-mod (string-to-number (org-table-get-constant $2)))))
 
* Proficiencies
  | Languages | Tools        | Armor   | Weapons |
  |-----------+--------------+---------+---------|
  | Common    | Thieves      | Light   | Simple  |
  | Sylvan    | Cartographer | Medium  |         |
  | Dwarvish  |              | Shields |         |
  | Elvish    |              |         |         |

* Equipment
  | Name                     | Quantity | Cost (gp) | Weight (lbs) | Total Weight (lbs) | Total Cost (gp) |
  |--------------------------+----------+-----------+--------------+--------------------+-----------------|
  | Studded Leather Armor    |        1 |        45 |           13 |                 13 |              45 |
  | Whip                     |        1 |         2 |            3 |                  3 |               2 |
  | Light Crossbow           |        1 |        25 |            5 |                  5 |              25 |
  | Bolts                    |       20 |           |              |                  0 |               0 |
  | Thieves tools            |        1 |           |              |                  0 |               0 |
  | Dungeoneer's Pack        |        1 |           |              |                  0 |               0 |
  | Map to a ruin or dungeon |        1 |           |              |                  0 |               0 |
  | Bullseye lantern         |          |           |              |                  0 |               0 |
  | Miner's Pick             |          |           |              |                  0 |               0 |
  | Traveler's clothes       |          |           |              |                  0 |               0 |
  | Shovel                   |          |           |              |                  0 |               0 |
  | 2 person tent            |          |           |              |                  0 |               0 |
  | Feather Fall (weed)      |          |           |              |                    |                 |
  | Drift Globe              |          |           |              |                    |                 |
  |--------------------------+----------+-----------+--------------+--------------------+-----------------|
  | Carry Capacity           |          |           |              |                  0 |               0 |
  #+TBLFM: $5=($2 * $4)
  #+TBLFM: $6=($2 * $3)
  #+TBLFM: @37$5=vsum(@2$5..@37$5)
  #+TBLFM: @37$6=vsum(@2$6..@36$6)
  #+TBLFM: @37$2=($STR * 10)
 
** Money
| Copper | Silver | Electrum | Gold | Platinum | Total (Gold) |
|--------+--------+----------+------+----------+--------------|
|      0 |      0 |        0 |   43 |        0 |            0 |
#+TBLFM: $6=(($1 / 100) + ($2 / 10) + ($3 / 2) + $4 + ($5 * 10)) 

** Infused Items
| Item           | Infusion        |
|----------------+-----------------|
| Whip           | Enhanced Weapon |
| Light Crossbow | Repeating shot  |

* Report Card
Year 1 aced the Exam
Fought in a tournament and lost in the 3rd round

Alester mr spit take orders a Cup of Sadness
Javenesh (orc) was hitting on me he want to get butter beers

Exam 2 - Passed first check nature, didn't pass animal handling

Exam 3 (duel)
Failed

Roll Sage (Festival)
I am performing, doing a poem is allowed

Haiku - 
Uncover the past
excavating artifacts
Archeology

Relationships
| Person              | Friend point |
|---------------------+--------------|
| Aella goes by Ella  |            1 |
| Gruewl              |            1 |
| Shaggy (Not Dealer) |            3 |
|                     |              |
| Val                 |              |
| Archy               |              |
| Alester             |              |
| Reed                |              |
| Chassy              |              |
